Server/TempTesting/SecurityIdeas.org
* Idea One:
** Description
   Only key-exchange plus encryption. With authentication phrase afterwards exchanged between client and server.
** Problems
- Can be guessed if authentication phrase used is short.
- Could be made more secure if I wasn't lazy and did proper authentication.

* Idea Two:
** Description
   SSL with self-signed certificate.

** Problems
- Implementation difficulties are likely, since I've never used it before.
- How to transfer certificate between

* Idea Three:
** Description

