Server/TempTesting/SecurityIdeas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>SecurityIdeas</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="SecurityIdeas"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-11-14 11:50:59 PST"/>
<meta name="author" content="Sterling"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">SecurityIdeas</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Idea One:</a>
<ul>
<li><a href="#sec-1-1">1.1 Description</a></li>
<li><a href="#sec-1-2">1.2 Problems</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Idea Two:</a>
<ul>
<li><a href="#sec-2-1">2.1 Description</a></li>
<li><a href="#sec-2-2">2.2 Problems</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Idea Three:</a>
<ul>
<li><a href="#sec-3-1">3.1 Description</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Idea One:</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Description</h3>
<div class="outline-text-3" id="text-1-1">

<p>   Only key-exchange plus encryption. With authentication phrase afterwards exchanged between client and server.
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Problems</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li>Can be guessed if authentication phrase used is short.
</li>
<li>Could be made more secure if I wasn't lazy and did proper authentication.
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Idea Two:</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Description</h3>
<div class="outline-text-3" id="text-2-1">

<p>   SSL with self-signed certificate.
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Problems</h3>
<div class="outline-text-3" id="text-2-2">

<ul>
<li>Implementation difficulties are likely, since I've never used it before.
</li>
<li>How to transfer certificate between
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Idea Three:</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Description</h3>
<div class="outline-text-3" id="text-3-1">


</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-11-14 11:50:59 PST</p>
<p class="author">Author: Sterling</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
